# Доработайте класс комплексного числа из прошлого 
# занятия: переопределите математические 
# операторы (__+, -, /, *, ==__), так, чтобы они
# работали с другими комплексными и со стандартными
# числами. Добейтесь правильной работы с комплексным 
# числом функций `print()`, `abs()`, а также
# реализуйте `getter` и `setter` 
# с использованием декоратора `@property`. Добавьте 
# выбросы исключений при некорректном использовании 
# вашего числа, например: выбросом `ValueError` при вводе 
# некорректных значений в `setter` класса, выбросом своего исключения в 
# случае попытки перевода в экспоненциальную 
# форму, когда это невозможно. Поверх напишите программу 
# калькулятор, принимающую у пользователя два комплексных
# числа и проводящую с ними арифметические операции на
# выбор пользователя. Калькулятор должен уметь ловить и 
# обрабатывать исключения, не роняя программу,
# а объясняя пользователю, что пошло не так.

